silidev2025/SIREN/Research-main/firmware/siren_esp32/siren_esp32.ino
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <time.h>

#include "secrets.h"

const int PIN_LED_GREEN  = 25;
const int PIN_LED_YELLOW = 26;
const int PIN_LED_RED    = 27;
const int PIN_BUZZER     = 14;
const int PIN_BUZZER2    = 13;

// The MPU6050 and the LCD share one I2C bus. They do not clash because each
// answers on its own address: LCD 0x27, MPU6050 0x68 (0x69 if AD0 is high).
const int PIN_SDA = 21;
const int PIN_SCL = 22;

LiquidCrystal_I2C lcd(0x27, 16, 2);

#define BUZZER_IS_ACTIVE 1

// ---------------------------------------------------------------------------
// MPU6050
// ---------------------------------------------------------------------------
const uint8_t MPU_REG_SMPLRT_DIV   = 0x19;
const uint8_t MPU_REG_CONFIG       = 0x1A;
const uint8_t MPU_REG_ACCEL_CONFIG = 0x1C;
const uint8_t MPU_REG_ACCEL_XOUT_H = 0x3B;
const uint8_t MPU_REG_PWR_MGMT_1   = 0x6B;
const uint8_t MPU_REG_WHO_AM_I     = 0x75;

// +/-2 g full scale. Earthquake shaking that matters here is well under 1 g,
// and the smallest range gives the finest resolution: 16384 counts per g.
const float LSB_PER_G = 16384.0f;

uint8_t  mpuAddr  = 0;
bool     mpuReady = false;
uint32_t sensorErrors = 0;

// A still accelerometer always feels exactly 1 g of gravity, whatever way it
// is mounted. If calibration measures something far from 1 g, the sensor is
// not being read correctly and every magnitude after it would be wrong.
const float GRAVITY_MIN_G = 0.85f;
const float GRAVITY_MAX_G = 1.15f;

// The MPU6050's digital noise floor is a few thousandths of a g. Anything
// well above that during calibration means the board was moving or bumped.
const float SIGMA_WARN_G = 0.020f;

const uint16_t CAL_SAMPLES     = 1000;
const uint8_t  CAL_INTERVAL_MS = 10;
const uint8_t  MA_WINDOW       = 8;
const uint32_t SAMPLE_US       = 5000;

const float    SIGMA_MULTIPLIER  = 3.0f;

// The MPU6050 is far quieter than the ADXL335 read through the ESP32's ADC,
// so the trigger can sit lower and give the Yellow band real room. If desk
// bumps or footsteps start setting it off, raise this towards 0.050.
const float    MIN_TRIGGER_G     = 0.030f;

// Never let a noisy calibration push the trigger past the Red boundary,
// which would silently make Yellow impossible.
const float    MAX_TRIGGER_G     = 0.090f;

const float    ONSET_FRACTION    = 0.50f;
const uint16_t CONFIRM_MS        = 300;
const uint8_t  MIN_SAMPLES_ABOVE = 8;

// Alarm sounds for 3 seconds, then the system goes straight back to
// monitoring so it can detect again right away.
const uint16_t ALERT_HOLD_MS     = 3000;
const uint16_t COOLDOWN_MS       = 0;

// Must stay in lockstep with Intensity.fromMagnitude in the mobile app
// (shared/src/commonMain/kotlin/com/siren/mobile/model/Models.kt) and with the
// thresholds published in the research paper:
//   Green  0.000 - 0.010 g   Intensity I-IV    light shaking
//   Yellow 0.010 - 0.120 g   Intensity V-VI    moderate shaking
//   Red    0.120 g and above Intensity VII+    destructive shaking
const float BAND_YELLOW_G = 0.010f;
const float BAND_RED_G    = 0.120f;

float biasX = 0, biasY = 0, biasZ = 1;
float sigmaResultantG = 0.0f;
float gravityG = 1.0f;
float triggerG = MIN_TRIGGER_G;
float onsetG   = MIN_TRIGGER_G * ONSET_FRACTION;
bool  calibrationSuspect = false;

int16_t  bufX[MA_WINDOW], bufY[MA_WINDOW], bufZ[MA_WINDOW];
uint8_t  bufIdx = 0;
int32_t  sumX = 0, sumY = 0, sumZ = 0;
bool     bufPrimed = false;

enum State { IDLE, CONFIRMING, ALERTING, COOLDOWN };
State state = IDLE;

uint32_t tOnset = 0, tDetect = 0, tAlert = 0, tLed = 0, tLcd = 0, tStateEnd = 0;
float    peakG = 0;
uint8_t  samplesAbove = 0;
uint16_t seq = 0;
char     lastType[10] = "shake";

// A knock or a dropped object produces one enormous spike and nothing after
// it, while an earthquake shakes continuously. Classifying on the mean over
// the confirmation window instead of the single highest sample separates the
// two: an impulse averages down, sustained motion does not.
float    sumG = 0;
uint16_t countG = 0;

uint32_t nextSampleUs = 0;

String   idToken;
String   refreshToken;
uint32_t tokenRefreshAtMs = 0;
bool     authed = false;

const char* bandName(float g) {
  if (g >= BAND_RED_G)    return "red";
  if (g >= BAND_YELLOW_G) return "yellow";
  return "green";
}

void buzzerOn() {
#if BUZZER_IS_ACTIVE
  digitalWrite(PIN_BUZZER,  HIGH);
  digitalWrite(PIN_BUZZER2, HIGH);
#else
  #if ESP_ARDUINO_VERSION_MAJOR >= 3
    tone(PIN_BUZZER,  2500);
    tone(PIN_BUZZER2, 2500);
  #else
    ledcSetup(0, 2500, 8);
    ledcAttachPin(PIN_BUZZER, 0);
    ledcWrite(0, 128);
    ledcSetup(1, 2500, 8);
    ledcAttachPin(PIN_BUZZER2, 1);
    ledcWrite(1, 128);
  #endif
#endif
}

void buzzerOff() {
#if BUZZER_IS_ACTIVE
  digitalWrite(PIN_BUZZER,  LOW);
  digitalWrite(PIN_BUZZER2, LOW);
#else
  #if ESP_ARDUINO_VERSION_MAJOR >= 3
    noTone(PIN_BUZZER);
    noTone(PIN_BUZZER2);
  #else
    ledcWrite(0, 0);
    ledcWrite(1, 0);
  #endif
#endif
}

void setLeds(bool g, bool y, bool r) {
  digitalWrite(PIN_LED_GREEN,  g ? HIGH : LOW);
  digitalWrite(PIN_LED_YELLOW, y ? HIGH : LOW);
  digitalWrite(PIN_LED_RED,    r ? HIGH : LOW);
}

void lcdTwoLines(const char* a, const char* b) {
  lcd.clear();
  lcd.setCursor(0, 0); lcd.print(a);
  lcd.setCursor(0, 1); lcd.print(b);
}

// ---------------------------------------------------------------------------
// MPU6050 low-level access (plain Wire, no extra library needed)
// ---------------------------------------------------------------------------
bool i2cPresent(uint8_t addr) {
  Wire.beginTransmission(addr);
  return Wire.endTransmission() == 0;
}

bool mpuWrite(uint8_t reg, uint8_t val) {
  Wire.beginTransmission(mpuAddr);
  Wire.write(reg);
  Wire.write(val);
  return Wire.endTransmission() == 0;
}

int mpuReadByte(uint8_t reg) {
  Wire.beginTransmission(mpuAddr);
  Wire.write(reg);
  if (Wire.endTransmission(false) != 0) return -1;
  if (Wire.requestFrom((uint16_t)mpuAddr, (size_t)1, true) != 1) return -1;
  return Wire.read();
}

bool mpuInit() {
  mpuReady = false;

  if      (i2cPresent(0x68)) mpuAddr = 0x68;
  else if (i2cPresent(0x69)) mpuAddr = 0x69;
  else {
    Serial.println("SENSOR,ERR,MPU6050 not found on I2C (tried 0x68 and 0x69)");
    Serial.println("SENSOR,HINT,check VCC=3V3, GND, SDA=GPIO21, SCL=GPIO22; type I to scan the bus");
    return false;
  }

  mpuWrite(MPU_REG_PWR_MGMT_1, 0x80);   // reset
  delay(100);
  mpuWrite(MPU_REG_PWR_MGMT_1, 0x01);   // wake up, gyro PLL clock (more stable)
  delay(50);
  mpuWrite(MPU_REG_SMPLRT_DIV, 0x04);   // 1 kHz / (1 + 4) = 200 Hz, matches SAMPLE_US
  mpuWrite(MPU_REG_CONFIG, 0x03);       // digital low-pass ~44 Hz, cuts high-frequency noise
  bool ok = mpuWrite(MPU_REG_ACCEL_CONFIG, 0x00);   // +/-2 g

  int who = mpuReadByte(MPU_REG_WHO_AM_I);

  // Genuine MPU6050 answers 0x68. Many GY-521 boards carry a clone (0x70,
  // 0x72, 0x98...) with the same accelerometer registers, so only warn.
  Serial.printf("SENSOR,ok,addr=0x%02X,whoami=0x%02X%s\n",
                mpuAddr, who < 0 ? 0 : who,
                (who == 0x68) ? "" : ",clone-or-variant (should still work)");

  mpuReady = ok && who >= 0;
  if (!mpuReady) Serial.println("SENSOR,ERR,MPU6050 answered but would not configure");
  return mpuReady;
}

