silidev2025/SIREN/Research-main/firmware/siren_esp32/siren_esp32.ino
bool readAccelRaw(int16_t& ax, int16_t& ay, int16_t& az) {
  if (!mpuReady) return false;

  Wire.beginTransmission(mpuAddr);
  Wire.write(MPU_REG_ACCEL_XOUT_H);
  if (Wire.endTransmission(false) != 0) return false;
  if (Wire.requestFrom((uint16_t)mpuAddr, (size_t)6, true) != 6) return false;

  // Read into separate bytes first: in "(read() << 8) | read()" C++ does not
  // guarantee which read() runs first, which can silently swap the bytes.
  uint8_t xh = Wire.read(), xl = Wire.read();
  uint8_t yh = Wire.read(), yl = Wire.read();
  uint8_t zh = Wire.read(), zl = Wire.read();
  ax = (int16_t)((xh << 8) | xl);
  ay = (int16_t)((yh << 8) | yl);
  az = (int16_t)((zh << 8) | zl);
  return true;
}

void noteSensorError() {
  sensorErrors++;
  static uint32_t lastPrint = 0;
  if (millis() - lastPrint > 1000) {
    lastPrint = millis();
    Serial.printf("SENSOR,ERR,read failed,total=%lu\n", (unsigned long)sensorErrors);
  }
}

float readResultantG() {
  int16_t rx, ry, rz;

  // A failed read counts as "no motion". Returning garbage here is exactly
  // what caused false alarms with the old sensor, so never guess.
  if (!readAccelRaw(rx, ry, rz)) {
    noteSensorError();
    return 0.0f;
  }

  if (!bufPrimed) {
    for (uint8_t i = 0; i < MA_WINDOW; i++) { bufX[i] = rx; bufY[i] = ry; bufZ[i] = rz; }
    sumX = (int32_t)rx * MA_WINDOW;
    sumY = (int32_t)ry * MA_WINDOW;
    sumZ = (int32_t)rz * MA_WINDOW;
    bufPrimed = true;
  }

  sumX += rx - bufX[bufIdx]; bufX[bufIdx] = rx;
  sumY += ry - bufY[bufIdx]; bufY[bufIdx] = ry;
  sumZ += rz - bufZ[bufIdx]; bufZ[bufIdx] = rz;
  bufIdx = (bufIdx + 1) % MA_WINDOW;

  // Subtracting the calibrated bias removes gravity, leaving only the shaking.
  float dx = (sumX / (float)MA_WINDOW) / LSB_PER_G - biasX;
  float dy = (sumY / (float)MA_WINDOW) / LSB_PER_G - biasY;
  float dz = (sumZ / (float)MA_WINDOW) / LSB_PER_G - biasZ;

  return sqrtf(dx * dx + dy * dy + dz * dz);
}

// ---------------------------------------------------------------------------
// Calibration
// ---------------------------------------------------------------------------
void printCalibration() {
  Serial.println("CAL,done");
  Serial.printf("CAL,bias_g,%.4f,%.4f,%.4f\n", biasX, biasY, biasZ);
  Serial.printf("CAL,gravity_g,%.4f\n", gravityG);
  Serial.printf("CAL,sigma_g,%.5f\n", sigmaResultantG);
  Serial.printf("CAL,trigger_g,%.4f\n", triggerG);
  Serial.printf("CAL,onset_g,%.4f\n", onsetG);
  Serial.printf("CAL,health,%s\n", calibrationSuspect ? "SUSPECT" : "ok");
}

void checkCalibrationHealth(uint16_t failedReads) {
  calibrationSuspect = false;

  if (!mpuReady) {
    calibrationSuspect = true;
    Serial.println("CAL,WARN,no MPU6050, detection is off until it is connected (then type C)");
    return;
  }

  if (failedReads > 0) {
    calibrationSuspect = true;
    Serial.printf("CAL,WARN,%u of %u reads failed, check SDA/SCL wires\n",
                  failedReads, CAL_SAMPLES);
  }

  if (gravityG < GRAVITY_MIN_G || gravityG > GRAVITY_MAX_G) {
    calibrationSuspect = true;
    Serial.printf("CAL,WARN,sensor feels %.3f g of gravity, expected about 1.000 g\n", gravityG);
    Serial.println("CAL,WARN,the sensor is not being read correctly; check wiring");
  }

  if (sigmaResultantG > SIGMA_WARN_G) {
    calibrationSuspect = true;
    Serial.printf("CAL,WARN,noise %.4f g is high, expected under %.3f g\n",
                  sigmaResultantG, SIGMA_WARN_G);
    Serial.println("CAL,WARN,recalibrate with C while nothing touches the sensor");
  }
}

void calibrate() {
  state = IDLE;
  setLeds(false, false, false);
  buzzerOff();

  if (!mpuReady) mpuInit();

  lcdTwoLines("Calibrating...", "Keep it still");
  Serial.println("CAL,start,keep the sensor still");

  double sX = 0, sY = 0, sZ = 0;
  double qX = 0, qY = 0, qZ = 0;
  uint16_t good = 0, failed = 0;

  for (uint16_t i = 0; i < CAL_SAMPLES; i++) {
    int16_t rx, ry, rz;
    if (readAccelRaw(rx, ry, rz)) {
      double gx = rx / LSB_PER_G, gy = ry / LSB_PER_G, gz = rz / LSB_PER_G;
      sX += gx; qX += gx * gx;
      sY += gy; qY += gy * gy;
      sZ += gz; qZ += gz * gz;
      good++;
    } else {
      failed++;
    }

    if (i % 100 == 0) { lcd.setCursor(14, 0); lcd.print((int)(i / 100)); }
    delay(CAL_INTERVAL_MS);
  }

  if (good >= 2) {
    const double n = good;
    biasX = sX / n;
    biasY = sY / n;
    biasZ = sZ / n;

    double varX = (qX - (sX * sX) / n) / (n - 1);
    double varY = (qY - (sY * sY) / n) / (n - 1);
    double varZ = (qZ - (sZ * sZ) / n) / (n - 1);
    if (varX < 0) varX = 0;
    if (varY < 0) varY = 0;
    if (varZ < 0) varZ = 0;

    sigmaResultantG = sqrt(varX + varY + varZ);
    gravityG = sqrtf(biasX * biasX + biasY * biasY + biasZ * biasZ);
  } else {
    sigmaResultantG = 0;
    gravityG = 0;
  }

  float thresholdG = SIGMA_MULTIPLIER * sigmaResultantG;
  triggerG = max(thresholdG, MIN_TRIGGER_G);
  triggerG = min(triggerG, MAX_TRIGGER_G);
  onsetG   = triggerG * ONSET_FRACTION;

  bufPrimed = false;
  checkCalibrationHealth(failed);
  printCalibration();

  if (!mpuReady)               lcdTwoLines("MPU6050 missing", "Check SDA/SCL");
  else if (calibrationSuspect) lcdTwoLines("Check sensor", "See serial log");
  else                         lcdTwoLines("S.I.R.E.N. ready", "Monitoring...");
  setLeds(true, false, false);
  nextSampleUs = micros();
}

// ---------------------------------------------------------------------------
// Network and Firebase
// ---------------------------------------------------------------------------
void connectWifi() {
  Serial.printf("WiFi: connecting to %s\n", WIFI_SSID);
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  uint32_t start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 30000) {
    delay(500);
    Serial.print('.');
  }
  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    Serial.print("WiFi: connected, ip=");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println("WiFi: FAILED -- check SSID/password and that it is 2.4 GHz");
  }
}

void syncClock() {
  configTime(0, 0, "pool.ntp.org", "time.nist.gov");
  Serial.print("NTP: syncing");
  uint32_t start = millis();
  while (time(nullptr) < 1700000000 && millis() - start < 20000) {
    delay(300);
    Serial.print('.');
  }
  Serial.println();
  Serial.printf("NTP: epoch=%lu\n", (unsigned long)time(nullptr));
}

