silidev2025/SIREN/Research-main/firmware/siren_esp32/siren_esp32.ino
String isoNowUtc() {
  time_t now = time(nullptr);
  struct tm t;
  gmtime_r(&now, &t);
  char buf[25];
  strftime(buf, sizeof(buf), "%Y-%m-%dT%H:%M:%SZ", &t);
  return String(buf);
}

int postJson(const String& url, const String& body, String& out, const char* contentType = "application/json") {
  WiFiClientSecure client;

  client.setInsecure();

  HTTPClient http;
  http.setTimeout(12000);
  if (!http.begin(client, url)) {
    out = "begin() failed";
    return -1;
  }
  http.addHeader("Content-Type", contentType);
  if (idToken.length() && url.indexOf("firestore.googleapis.com") >= 0) {
    http.addHeader("Authorization", "Bearer " + idToken);
  }

  int code = http.POST(body);
  out = http.getString();
  http.end();
  return code;
}

bool signIn() {
  String url = String("https://identitytoolkit.googleapis.com/v1/accounts:signInWithPassword?key=") + FIREBASE_API_KEY;

  JsonDocument req;
  req["email"] = ESP32_ACCOUNT_EMAIL;
  req["password"] = ESP32_ACCOUNT_PASSWORD;
  req["returnSecureToken"] = true;
  String body;
  serializeJson(req, body);

  String resp;
  int code = postJson(url, body, resp);
  if (code != 200) {
    Serial.printf("AUTH: sign-in failed http=%d %s\n", code, resp.c_str());
    authed = false;
    return false;
  }

  JsonDocument doc;
  if (deserializeJson(doc, resp)) {
    Serial.println("AUTH: could not parse sign-in response");
    return false;
  }

  idToken      = doc["idToken"].as<String>();
  refreshToken = doc["refreshToken"].as<String>();
  uint32_t expiresIn = doc["expiresIn"].as<String>().toInt();
  if (expiresIn < 60) expiresIn = 3600;
  tokenRefreshAtMs = millis() + (expiresIn - 300) * 1000UL;
  authed = true;

  Serial.printf("AUTH: signed in as %s, token good for %lus\n",
                ESP32_ACCOUNT_EMAIL, (unsigned long)expiresIn);
  return true;
}

bool refreshIdToken() {
  if (!refreshToken.length()) return signIn();

  String url = String("https://securetoken.googleapis.com/v1/token?key=") + FIREBASE_API_KEY;
  String body = "grant_type=refresh_token&refresh_token=" + refreshToken;

  String resp;
  int code = postJson(url, body, resp, "application/x-www-form-urlencoded");
  if (code != 200) {
    Serial.printf("AUTH: refresh failed http=%d, falling back to sign-in\n", code);
    return signIn();
  }

  JsonDocument doc;
  if (deserializeJson(doc, resp)) return signIn();

  idToken      = doc["id_token"].as<String>();
  refreshToken = doc["refresh_token"].as<String>();
  uint32_t expiresIn = doc["expires_in"].as<String>().toInt();
  if (expiresIn < 60) expiresIn = 3600;
  tokenRefreshAtMs = millis() + (expiresIn - 300) * 1000UL;
  authed = true;

  Serial.println("AUTH: token refreshed");
  return true;
}

void keepAuthFresh() {
  if (!authed) { signIn(); return; }
  if ((int32_t)(millis() - tokenRefreshAtMs) >= 0) refreshIdToken();
}

String makeAlertId(uint16_t s) {
  return String(NODE_ID) + "-" + String((unsigned long)time(nullptr)) + "-" + String(s);
}

bool createAlert(const char* intensity, float magnitudeG, uint16_t s, String& alertIdOut) {
  alertIdOut = makeAlertId(s);

  String url = String("https://firestore.googleapis.com/v1/projects/") + FIREBASE_PROJECT_ID +
               "/databases/(default)/documents/alerts?documentId=" + alertIdOut;

  JsonDocument doc;
  JsonObject f = doc["fields"].to<JsonObject>();
  f["intensity"]["stringValue"]     = intensity;
  f["magnitudeG"]["doubleValue"]    = magnitudeG;
  f["detectedAt"]["timestampValue"] = isoNowUtc();
  f["source"]["stringValue"]        = "esp32";
  f["nodeId"]["stringValue"]        = NODE_ID;
  f["closed"]["booleanValue"]       = false;

  String body;
  serializeJson(doc, body);

  String resp;
  int code = postJson(url, body, resp);

  if (code == 401 || code == 403) {
    Serial.println("FS: token rejected, refreshing and retrying once");
    if (refreshIdToken()) code = postJson(url, body, resp);
  }

  if (code == 200) return true;

  Serial.printf("FS: create failed http=%d %s\n", code, resp.c_str());
  return false;
}

void uploadAlert(const char* band, float g) {
  uint32_t t0 = millis();

  if (WiFi.status() != WL_CONNECTED) {
    Serial.printf("CLOUD,ERR,offline,%lu\n", (unsigned long)(millis() - t0));
    return;
  }
  keepAuthFresh();
  if (!authed) {
    Serial.printf("CLOUD,ERR,auth,%lu\n", (unsigned long)(millis() - t0));
    return;
  }

  String alertId;
  if (createAlert(band, g, seq, alertId)) {
    Serial.printf("CLOUD,OK,%s,%lu\n", alertId.c_str(), (unsigned long)(millis() - t0));
  } else {
    Serial.printf("CLOUD,ERR,write,%lu\n", (unsigned long)(millis() - t0));
  }
}

// ---------------------------------------------------------------------------
// Alerting
// ---------------------------------------------------------------------------
void fireAlert(float g) {
  tAlert = millis();
  const char* band = bandName(g);

  bool isRed    = (g >= BAND_RED_G);
  bool isYellow = (!isRed && g >= BAND_YELLOW_G);
  setLeds(!isRed && !isYellow, isYellow, isRed);
  tLed = millis();

  char line2[20];
  // 3 decimals, not 2: the Green band is only 0.010 g wide, so "%.2f" would
  // round a 0.005 g reading to "0.01 g" -- exactly the Yellow boundary.
  snprintf(line2, sizeof(line2), "%.3f g  %s", g, band);
  if (isRed)         lcdTwoLines("RED - TAKE COVER", line2);
  else if (isYellow) lcdTwoLines("YELLOW - ALERT",   line2);
  else               lcdTwoLines("GREEN - MINOR",    line2);
  tLcd = millis();

  // Both Yellow and Red sound the alarm. Green is informational only, so it
  // stays silent -- otherwise the buzzer would fire on every passing footstep.
  if (isRed || isYellow) buzzerOn();

  seq++;

  Serial.printf("TRIAL,%u,%s,%.3f,%s,%lu,%lu,%lu,%lu,%lu\n",
                seq, lastType, g, band,
                (unsigned long)(tDetect - tOnset),
                (unsigned long)(tAlert - tDetect),
                (unsigned long)(tLed - tAlert),
                (unsigned long)(tLcd - tAlert),
                (unsigned long)(tLcd - tOnset));

  state = ALERTING;
  tStateEnd = millis() + ALERT_HOLD_MS;

  uploadAlert(band, g);

  // The upload blocks for a couple of seconds. Restart the sample clock so
  // the loop does not race through a backlog of missed samples afterwards.
  nextSampleUs = micros();
}

void rejectAsNoise(float g) {
  Serial.printf("REJECT,%s,%.3f,%u,below confirmation window\n", lastType, g, samplesAbove);
  state = IDLE;
}

void endAlert() {
  buzzerOff();
  setLeds(true, false, false);
  lcdTwoLines("S.I.R.E.N. ready", "Monitoring...");
  state = COOLDOWN;
  tStateEnd = millis() + COOLDOWN_MS;
}

// ---------------------------------------------------------------------------
// Serial console
// ---------------------------------------------------------------------------
void printLive() {
  int16_t rx, ry, rz;
  if (!readAccelRaw(rx, ry, rz)) {
    Serial.println("LIVE,ERR,could not read the MPU6050");
    return;
  }
  float gx = rx / LSB_PER_G, gy = ry / LSB_PER_G, gz = rz / LSB_PER_G;
  // At rest: one axis near +/-1.000 (the one facing up or down), the other
  // two near 0.000, total near 1.000, and shake_g close to zero.
  Serial.printf("LIVE,g,%.3f,%.3f,%.3f,total,%.3f,shake_g,%.4f\n",
                gx, gy, gz, sqrtf(gx * gx + gy * gy + gz * gz), readResultantG());
}

void scanI2C() {
  Serial.println("I2C,scan,start");
  uint8_t found = 0;
  for (uint8_t a = 1; a < 127; a++) {
    if (i2cPresent(a)) {
      const char* what = (a == 0x27 || a == 0x3F) ? "LCD"
                       : (a == 0x68 || a == 0x69) ? "MPU6050" : "?";
      Serial.printf("I2C,found,0x%02X,%s\n", a, what);
      found++;
    }
  }
  Serial.printf("I2C,scan,done,%u device(s)\n", found);
}

void handleCommand(char c) {
  switch (c) {
    case 'C': case 'c': calibrate(); break;
    case 'Z': case 'z': printCalibration(); break;
    case 'S': case 's': endAlert(); break;
    case 'L': case 'l': printLive(); break;
    case 'I': case 'i': scanI2C(); break;
    case 'W': case 'w':
      Serial.printf("NET,wifi=%d,ip=%s,authed=%d,epoch=%lu\n",
                    WiFi.status() == WL_CONNECTED ? 1 : 0,
                    WiFi.localIP().toString().c_str(),
                    authed ? 1 : 0, (unsigned long)time(nullptr));
      break;
    case 'G': case 'g': strcpy(lastType, "manual"); tOnset = tDetect = millis(); fireAlert(0.005f); break;
    case 'Y': case 'y': strcpy(lastType, "manual"); tOnset = tDetect = millis(); fireAlert(0.050f); break;
    case 'R': case 'r': strcpy(lastType, "manual"); tOnset = tDetect = millis(); fireAlert(0.300f); break;
    default: break;
  }
}

void pumpConsole() {
  while (Serial.available()) {
    char c = Serial.read();
    if (c == '\r' || c == '\n') continue;
    handleCommand(c);
  }
}

// ---------------------------------------------------------------------------
// Setup and main loop
// ---------------------------------------------------------------------------
void setup() {
  Serial.begin(115200);
  delay(300);

  pinMode(PIN_LED_GREEN,  OUTPUT);
  pinMode(PIN_LED_YELLOW, OUTPUT);
  pinMode(PIN_LED_RED,    OUTPUT);
  pinMode(PIN_BUZZER,     OUTPUT);
  pinMode(PIN_BUZZER2,    OUTPUT);
  buzzerOff();

  Wire.begin(PIN_SDA, PIN_SCL);
  lcd.init();
  lcd.backlight();
  lcdTwoLines("S.I.R.E.N.", "Booting...");

  setLeds(true, true, true); delay(400); setLeds(false, false, false);

  Serial.println("\nBOOT,siren-esp32,v3.0-mpu6050");
  Serial.printf("node=%s project=%s\n", NODE_ID, FIREBASE_PROJECT_ID);
  Serial.println("HEADER,seq,type,peak_g,intensity,detect_ms,process_ms,led_ms,lcd_ms,total_ms");

  mpuInit();

  connectWifi();
  syncClock();
  signIn();

  delay(1500);
  calibrate();
}

void loop() {
  pumpConsole();

  static uint32_t lastCheck = 0;
  if (millis() - lastCheck > 30000) {
    lastCheck = millis();
    if (WiFi.status() != WL_CONNECTED) connectWifi();
    else keepAuthFresh();
  }

  if ((int32_t)(micros() - nextSampleUs) < 0) return;
  nextSampleUs += SAMPLE_US;

  float g = readResultantG();
  uint32_t now = millis();

  switch (state) {

    case IDLE:
      if (g >= onsetG && tOnset == 0) tOnset = now;
      if (g < onsetG) tOnset = 0;
      if (g >= triggerG) {
        if (tOnset == 0) tOnset = now;
        tDetect      = now;
        peakG        = g;
        samplesAbove = 1;
        sumG         = g;
        countG       = 1;
        strcpy(lastType, "shake");
        state = CONFIRMING;
      }
      break;

    case CONFIRMING:
      if (g > peakG) peakG = g;
      sumG += g;
      countG++;
      if (g >= triggerG && samplesAbove < 255) samplesAbove++;
      if (now - tDetect >= CONFIRM_MS) {
        if (samplesAbove >= MIN_SAMPLES_ABOVE) fireAlert(sumG / countG);
        else { rejectAsNoise(peakG); tOnset = 0; }
      }
      break;

    case ALERTING:
      if (g > peakG) peakG = g;
      if ((int32_t)(now - tStateEnd) >= 0) endAlert();
      break;

    case COOLDOWN:
      if ((int32_t)(now - tStateEnd) >= 0) {
        state  = IDLE;
        tOnset = 0;
        peakG  = 0;
        sumG   = 0;
        countG = 0;
        nextSampleUs = micros();
      }
      break;
  }
}
